[{"sql": "SELECT l_tax, o_totalprice FROM lineitem JOIN orders ON o_orderkey = l_orderkey WHERE l_linenumber >= 3 AND o_orderkey <> 784709 AND l_orderkey <= 189383 AND o_clerk < 'Clerk#000000181'", "res_cnt": "1707", "execution_time": "4.83", "text": "Retrieve the tax rate and total price from the lineitem and orders tables where the line number is greater than or equal to 3, the order key is not equal to 784709, the order key is less than or equal to 189383, and the clerk's ID is less than 'Clerk#000000181'."}, {"sql": "SELECT p_type, ps_availqty, SUM(ps_suppkey) FROM part JOIN partsupp ON ps_partkey = p_partkey WHERE ps_suppkey <> 3804 AND ps_partkey <= 57823 AND ps_availqty < 4781 GROUP BY p_type, ps_availqty HAVING SUM(ps_suppkey) > 1089 ORDER BY SUM(ps_suppkey) ASC", "res_cnt": "100967", "execution_time": "2.25", "text": "Retrieve the part type, available quantity of parts, and the sum of supplier keys from the part and partsupp tables where the supplier key is not equal to 3804, the part key is less than or equal to 57823, and the available quantity of parts is less than 4781. Group the results by part type and available quantity of parts, and only include groups where the sum of supplier keys is greater than 1089. Sort the results in ascending order based on the sum of supplier keys."}, {"sql": "SELECT c_phone, o_totalprice, n_comment, r_comment FROM orders JOIN customer ON c_custkey = o_custkey JOIN nation ON n_nationkey = c_nationkey JOIN region ON r_regionkey = n_regionkey WHERE n_nationkey < 8 AND o_orderstatus >= 'O' AND o_comment < 'ly around the pending theodo' ORDER BY c_phone ASC, n_comment ASC, o_totalprice ASC, r_comment ASC", "res_cnt": "1249285", "execution_time": "32.55", "text": "Retrieve the phone number of the customer, the total price of the order, the comment of the nation, and the comment of the region from the orders table, customer table, nation table, and region table, respectively, where the nation key is less than 8, the order status is greater than or equal to 'O', and the order comment is less than 'ly around the pending theodo'. Sort the result by customer phone number in ascending order, nation comment in ascending order, order total price in ascending order, and region comment in ascending order."}, {"sql": "SELECT s_acctbal, ps_supplycost, r_regionkey, n_name FROM region JOIN nation ON n_regionkey = r_regionkey JOIN supplier ON s_nationkey = n_nationkey JOIN partsupp ON ps_suppkey = s_suppkey WHERE r_name <= 'AFRICA' AND n_comment >= 'l platelets. regular accounts x-ray: unusual, regular acco' AND s_nationkey >= 0", "res_cnt": "1272240", "execution_time": "22.09", "text": "Retrieve the account balance, supply cost, region key, and nation name from the region, nation, supplier, and partsupp tables where the region name is less than or equal to 'AFRICA', the nation comment is greater than or equal to 'l platelets. regular accounts x-ray: unusual, regular acco', and the supplier nation key is greater than or equal to 0."}, {"sql": "SELECT o_orderkey, c_address FROM customer JOIN orders ON o_custkey = c_custkey WHERE c_phone <> '29-716-678-7355' AND o_custkey <= 16201 AND o_totalprice > 29849.7 AND o_clerk <> 'Clerk#000000361' AND o_shippriority >= 0 ORDER BY c_address DESC", "res_cnt": "150302", "execution_time": "2.55", "text": "Retrieve the order key and customer address from the customer and orders tables where the customer phone number is not '29-716-678-7355', the customer key is less than or equal to 16201, the order total price is greater than 29849.7, the order clerk is not 'Clerk#000000361', and the order ship priority is greater than or equal to 0. Sort the results by customer address in descending order."}, {"sql": "SELECT o_orderkey, l_comment FROM lineitem JOIN orders ON o_orderkey = l_orderkey WHERE o_orderpriority <= '5-LOW' AND l_shipdate <= '1993-08-01' AND l_suppkey < 701 AND o_custkey <= 64021", "res_cnt": "3880", "execution_time": "104.27", "text": "Retrieve the order key and comment from the lineitem and orders tables where the order priority is less than or equal to '5-LOW', the shipment date is before or on August 1st, 1993, the supplier key is less than 701, and the customer key is less than or equal to 64021."}, {"sql": "SELECT l_linenumber, ps_comment FROM partsupp JOIN lineitem ON l_suppkey = ps_partkey WHERE l_shipmode <> 'FOB' AND l_returnflag <= 'A' AND l_discount < 0.04 AND l_receiptdate > '1993-01-19'", "res_cnt": "13666156", "execution_time": "265.72", "text": "Retrieve the line number and comment from the Parts Supplier table and join it with the Line Item table where the supplier key matches the part key, and the shipment mode is not FOB, the return flag is less than or equal to A, the discount is less than 0.04, and the receipt date is after January 19th, 1993."}, {"sql": "SELECT l_returnflag, s_acctbal, ps_partkey FROM lineitem JOIN partsupp ON ps_partkey = l_suppkey JOIN supplier ON s_suppkey = ps_suppkey WHERE ps_partkey <= 33851 AND ps_comment > 'nts. bold, final theodolites wake after the regular Tiresias. blithely dogged requests are slyly according to the pending, stealt' AND l_suppkey <> 3674 AND l_orderkey > 4099425", "res_cnt": "31697273", "execution_time": "249.76", "text": "Retrieve the return flag, account balance, and part key from the Lineitem, Partsupp, and Supplier tables where the part key is less than or equal to 33851, the comment in Partsupp is greater than 'nts. bold, final theodolites wake after the regular Tiresias. blithely dogged requests are slyly according to the pending, stealt', the supplier key in Lineitem is not equal to 3674, and the order key in Lineitem is greater than 4099425."}, {"sql": "SELECT s_comment, p_size, ps_supplycost FROM part JOIN partsupp ON ps_partkey = p_partkey JOIN supplier ON s_suppkey = ps_suppkey WHERE ps_availqty = 6331 AND p_type > 'LARGE POLISHED NICKEL' AND p_retailprice < 1758.76 ORDER BY s_comment DESC", "res_cnt": "394", "execution_time": "7.79", "text": "Retrieve the comments of suppliers, size of parts, and supply cost of part-supplier combinations where the available quantity of the part is 6331, the type of the part is greater than 'LARGE POLISHED NICKEL', and the retail price of the part is less than 1758.76. The results should be sorted in descending order based on the comments of the suppliers."}, {"sql": "SELECT l_shipdate FROM lineitem WHERE l_extendedprice >= 50883.12 AND l_linenumber > 1 AND l_shipdate <> '1992-08-30' AND l_returnflag = 'A' ORDER BY l_shipdate DESC", "res_cnt": "3376197", "execution_time": "93.75", "text": "Retrieve the shipment dates from the lineitem table where the extended price is greater than or equal to 50883.12, the linenumber is greater than 1, the shipdate is not equal to '1992-08-30', and the return flag is 'A', and sort the results in descending order based on the shipment date."}, {"sql": "SELECT c_acctbal, o_orderpriority, n_name FROM nation JOIN customer ON c_nationkey = n_nationkey JOIN orders ON o_custkey = c_custkey WHERE c_comment = 'ar deposits believe special, express foxes. packages cajole slyly e' AND n_name <> 'JAPAN' AND c_mktsegment <= 'HOUSEHOLD' AND o_totalprice < 110238.65 AND c_name <= 'Customer#000013191'", "res_cnt": "7", "execution_time": "1.88", "text": "Retrieve the account balance, order priority, and nation name for customers who have a comment of 'ar deposits believe special, express foxes. packages cajole slyly e', are not from Japan, have a market segment of 'HOUSEHOLD', have a total order price less than 110238.65, and have a name less than or equal to 'Customer#000013191'."}, {"sql": "SELECT l_shipdate, ps_suppkey FROM lineitem, partsupp WHERE l_suppkey <= 80 AND ps_supplycost <> 334.23 AND l_shipmode = 'FOB' AND ps_availqty = 1178 AND ps_partkey > 198332 ORDER BY ps_suppkey ASC, l_shipdate DESC", "res_cnt": "5029728", "execution_time": "137.32", "text": "Retrieve the shipment date and supplier key from the Lineitem and Partsupp tables where the supplier key is less than or equal to 80, the supply cost is not equal to 334.23, the shipment mode is FOB, the available quantity is 1178, and the part key is greater than 198332. Sort the results by supplier key in ascending order and shipment date in descending order."}, {"sql": "SELECT p_type, ps_comment FROM part JOIN partsupp ON ps_partkey = p_partkey WHERE ps_availqty <> 1078 AND p_type < 'PROMO BURNISHED NICKEL' AND p_size > 8 AND p_container < 'LG CAN'", "res_cnt": "974546", "execution_time": "13.71", "text": "Retrieve the part type and part supplier comment from the Part and Partsupp tables where the available quantity of the part supplier is not equal to 1078, the part type is less than 'PROMO BURNISHED NICKEL', the part size is greater than 8, and the part container is less than 'LG CAN'."}, {"sql": "SELECT c_name, n_nationkey, o_clerk FROM nation JOIN customer ON c_nationkey = n_nationkey JOIN orders ON o_custkey = c_custkey WHERE n_name >= 'INDIA' AND c_phone <> '12-665-235-7505' AND c_nationkey <> 0 AND o_orderdate <> '1994-02-08' AND o_shippriority <= 0", "res_cnt": "9587942", "execution_time": "70.96", "text": "Retrieve the customer name, nation key, and clerk name from the nation, customer, and orders tables where the nation name is greater than or equal to 'INDIA', the customer phone number is not equal to '12-665-235-7505', the customer nation key is not equal to 0, the order date is not equal to '1994-02-08', and the order ship priority is less than or equal to 0."}, {"sql": "SELECT ps_comment FROM partsupp WHERE ps_availqty >= 9324 AND ps_suppkey <> 1716 AND ps_partkey >= 65143 AND ps_supplycost < 164.19 AND ps_comment <> 's use slyly pending instructions. furiously final ideas shall have to are c'", "res_cnt": "85446", "execution_time": "9.15", "text": "Retrieve the comments from the \"partsupp\" table where the available quantity is greater than or equal to 9324, the supplier key is not equal to 1716, the part key is greater than or equal to 65143, the supply cost is less than 164.19, and the comment is not equal to 's use slyly pending instructions. furiously final ideas shall have to are c'."}, {"sql": "SELECT r_name, s_suppkey, n_regionkey FROM supplier, nation, region WHERE r_regionkey >= 1 AND s_suppkey <= 9696 AND r_comment <> 'uickly special accounts cajole carefully blithely close requests. carefully final asymptotes haggle furiousl' AND s_name < 'Supplier#000008309' AND s_phone <> '19-247-536-8083' ORDER BY s_suppkey ASC, n_regionkey DESC, r_name ASC", "res_cnt": "623025", "execution_time": "3.5", "text": "Retrieve the supplier name, supplier key, and region key from the supplier, nation, and region tables where the region key is greater than or equal to 1, the supplier key is less than or equal to 9696, the region comment is not equal to 'uickly special accounts cajole carefully blithely close requests. carefully final asymptotes haggle furiousl', the supplier name is less than 'Supplier#000008309', and the supplier phone is not equal to '19-247-536-8083', and sort the results by supplier key in ascending order, region key in descending order, and region name in ascending order."}, {"sql": "SELECT o_orderpriority FROM orders WHERE o_orderpriority > '3-MEDIUM' AND o_totalprice > 130861.55 AND o_comment < 'inally pending packages sleep along the furiously special' AND o_custkey <= 16480 AND o_shippriority <= 0 AND o_orderdate <> '1997-02-20' ORDER BY o_orderpriority ASC", "res_cnt": "14448", "execution_time": "1.70", "text": "Retrieve the order priority from the \"orders\" table where the order priority is greater than '3-MEDIUM', the total price is greater than 130861.55, the comment is less than 'finally pending packages sleep along the furiously special', the customer key is less than or equal to 16480, the ship priority is less than or equal to 0, and the order date is not equal to '1997-02-20', and sort the results in ascending order based on the order priority."}, {"sql": "SELECT l_linenumber, s_address, ps_availqty FROM supplier JOIN partsupp ON ps_suppkey = s_suppkey JOIN lineitem ON l_suppkey = ps_partkey WHERE s_address > 'amCtx9qD7Dw0D4HkCoBNIpW9ZmM' AND l_comment <> 'ld accounts serve express requests. b' AND l_orderkey <= 2411266 AND s_comment <> 's. blithely regular deposits snooze carefully quickly' AND ps_partkey <> 64064 AND ps_supplycost >= 626.9 ORDER BY l_linenumber ASC", "res_cnt": "2948351", "execution_time": "19.08", "text": "Retrieve the line number, supplier address, and available quantity of parts from the supplier, partsupp, and lineitem tables where the supplier address is greater than 'amCtx9qD7Dw0D4HkCoBNIpW9ZmM', the line comment is not equal to 'ld accounts serve express requests. b', the order key is less than or equal to 2411266, the supplier comment is not equal to 's. blithely regular deposits snooze carefully quickly', the part key is not equal to 64064, and the supply cost is greater than or equal to 626.9, and sort the results by the line number in ascending order."}, {"sql": "SELECT n_name, s_nationkey, ps_comment FROM nation JOIN supplier ON s_nationkey = n_nationkey JOIN partsupp ON ps_suppkey = s_suppkey WHERE ps_suppkey >= 6409 AND ps_availqty <= 5816 AND n_name <> 'ROMANIA' AND s_acctbal > 2175.72", "res_cnt": "2979646", "execution_time": "46.05", "text": "Retrieve the name of the nation, the nation key of the supplier, and the comment of the parts supplier from the Nation, Supplier, and Partsupp tables where the supplier key is greater than or equal to 6409, the available quantity of the parts supplier is less than or equal to 5816, the name of the nation is not Romania, and the account balance of the supplier is greater than 2175.72."}, {"sql": "SELECT l_shipdate, s_acctbal, c_nationkey, ps_partkey, n_nationkey FROM lineitem JOIN partsupp ON ps_partkey = l_suppkey JOIN supplier ON s_suppkey = ps_suppkey JOIN nation ON n_nationkey = s_nationkey JOIN customer ON c_nationkey = n_nationkey WHERE s_address = '2Nf6B5RqqNb,J,Sjhfc2ui3Z' AND l_linestatus = 'F' ORDER BY c_nationkey DESC, s_acctbal DESC", "res_cnt": "71386872", "execution_time": "532.60", "text": "Retrieve the shipment date, supplier account balance, part key of parts supplier, nation key of customer, and nation key of supplier from the Lineitem, Partsupp, Supplier, Nation, and Customer tables, respectively, where the supplier address is '2Nf6B5RqqNb,J,Sjhfc2ui3Z' and the line status is 'F', and sort the result by customer nation key in descending order and supplier account balance in descending order."}, {"sql": "SELECT p_retailprice, ps_comment, s_suppkey, MIN(ps_availqty) FROM supplier JOIN partsupp ON ps_suppkey = s_suppkey JOIN part ON p_partkey = ps_partkey WHERE s_suppkey >= 3266 AND ps_availqty <> 9312 AND s_comment <= 'across the regular theodolites. regula' GROUP BY p_retailprice, ps_comment, s_suppkey HAVING MIN(ps_availqty) >= 2481", "res_cnt": "114465", "execution_time": "34.79", "text": "Retrieve the retail price, comment of the partsupplier, supplier key, and the minimum available quantity of each part, where the supplier key is greater than or equal to 3266, the available quantity is not equal to 9312, and the supplier comment is less than or equal to 'across the regular theodolites. regula', and group the results by retail price, partsupplier comment, and supplier key, and only show the results where the minimum available quantity is greater than or equal to 2481."}, {"sql": "SELECT o_orderstatus FROM orders WHERE o_orderstatus >= 'F' AND o_comment <> 'ts. bold platelets ab' AND o_clerk <= 'Clerk#000000672' AND o_custkey < 62692 ORDER BY o_orderstatus DESC", "res_cnt": "41902", "execution_time": "21.68", "text": "Retrieve the order status from the \"orders\" table where the order status is greater than or equal to 'F', the comment is not 'ts. bold platelets ab', the clerk is less than or equal to 'Clerk#000000672', and the customer key is less than 62692, then sort the results in descending order based on the order status."}, {"sql": "SELECT l_orderkey FROM lineitem WHERE l_discount <= 0.0 AND l_shipinstruct <= 'COLLECT COD' AND l_shipmode < 'REG AIR' AND l_shipdate = '1995-01-11' ORDER BY l_orderkey ASC", "res_cnt": "334", "execution_time": "27.65", "text": "Retrieve the order keys from the lineitem table where the discount is less than or equal to 0.0, the shipping instruction is 'COLLECT COD', the shipping mode is less than 'REG AIR', and the shipping date is '1995-01-11', and sort the results in ascending order by the order key."}, {"sql": "SELECT p_partkey, l_commitdate, o_clerk, ps_supplycost FROM orders JOIN lineitem ON l_orderkey = o_orderkey JOIN partsupp ON ps_partkey = l_suppkey JOIN part ON p_partkey = ps_partkey WHERE o_clerk = 'Clerk#000000551' AND o_shippriority >= 0 AND ps_comment >= 'sh. furiously special deposits nod fluffily. even deposits boost after the quickly ironic ideas. furiou'", "res_cnt": "5890", "execution_time": "32.78", "text": "Retrieve the part key, commit date, clerk, and supply cost from the orders, lineitem, partsupp, and part tables where the clerk is 'Clerk#000000551', the ship priority is greater than or equal to 0, and the comment in the partsupp table is greater than or equal to 'sh. furiously special deposits nod fluffily. even deposits boost after the quickly ironic ideas. furiou'."}, {"sql": "SELECT c_nationkey, o_shippriority, l_tax, n_regionkey, MAX(l_shipdate) FROM lineitem JOIN orders ON o_orderkey = l_orderkey JOIN customer ON c_custkey = o_custkey JOIN nation ON n_nationkey = c_nationkey WHERE o_orderpriority <= '4-NOT SPECIFIED' AND l_partkey <> 19162 GROUP BY c_nationkey, o_shippriority, l_tax, n_regionkey ORDER BY c_nationkey DESC, o_shippriority DESC, l_tax DESC", "res_cnt": "225", "execution_time": "293.07", "text": "Retrieve the maximum shipment date, nation key, ship priority, tax, and region key for each unique combination of customer nation, order ship priority, line item tax, and nation region, where the order priority is less than or equal to '4-NOT SPECIFIED' and the line item part key is not equal to 19162, and sort the results in descending order by customer nation, order ship priority, and line item tax."}, {"sql": "SELECT l_extendedprice, ps_supplycost, o_shippriority FROM orders JOIN lineitem ON l_orderkey = o_orderkey JOIN partsupp ON ps_partkey = l_suppkey WHERE l_returnflag <= 'R' AND o_comment <= 's? deposits sleep carefully according to the foxes. carefully even deposits' AND o_orderstatus > 'F' AND l_comment >= 'key players. regular theodolites'", "res_cnt": "50537296", "execution_time": "360.18", "text": "Retrieve the extended price, supply cost, and shipping priority from the orders, lineitem, and partsupp tables where the return flag is less than or equal to 'R', the order comment is less than or equal to 's? deposits sleep carefully according to the foxes. carefully even deposits', the order status is greater than 'F', and the line item comment is greater than or equal to 'key players. regular theodolites'."}, {"sql": "SELECT c_address, o_shippriority FROM orders JOIN customer ON c_custkey = o_custkey WHERE o_custkey > 147232 AND o_orderkey <= 4846240 AND c_phone > '23-576-689-1958' AND c_mktsegment > 'BUILDING' AND c_nationkey >= 20 AND c_comment <> 'beans hinder blithely sometimes final platele'", "res_cnt": "131253", "execution_time": "17.48", "text": "Retrieve the customer address and order shipping priority from the orders and customer tables where the customer key is greater than 147232, the order key is less than or equal to 4846240, the customer phone number is greater than '23-576-689-1958', the customer market segment is greater than 'BUILDING', the customer nation key is greater than or equal to 20, and the customer comment is not equal to 'beans hinder blithely sometimes final platele'."}, {"sql": "SELECT p_brand, ps_partkey FROM part JOIN partsupp ON ps_partkey = p_partkey WHERE ps_partkey > 92663 AND ps_availqty <= 9312 AND p_name <= 'azure sienna cornflower cyan white' AND p_retailprice < 1728.81 ORDER BY p_brand ASC", "res_cnt": "215865", "execution_time": "24.33", "text": "Retrieve the brand and part key from the \"part\" and \"partsupp\" tables where the part key is greater than 92663, the available quantity is less than or equal to 9312, the name of the part is less than or equal to 'azure sienna cornflower cyan white', and the retail price of the part is less than 1728.81. Sort the result by brand name in ascending order."}, {"sql": "SELECT s_name, ps_partkey, n_nationkey, SUM(s_nationkey) FROM partsupp JOIN supplier ON s_suppkey = ps_suppkey JOIN nation ON n_nationkey = s_nationkey WHERE s_nationkey <> 11 AND s_address < 'B1NwUSk0MfhhyceTtw' AND n_regionkey < 1 GROUP BY s_name, ps_partkey, n_nationkey HAVING SUM(s_nationkey) <> 18 ORDER BY SUM(s_nationkey) ASC", "res_cnt": "311360", "execution_time": "16.27", "text": "Retrieve the supplier name, part key, nation key, and the sum of the supplier nation key from the PartsSupp table joined with the Supplier table on the supplier key and the Nation table on the nation key where the supplier nation key is not equal to 11, the supplier address is less than 'B1NwUSk0MfhhyceTtw', and the nation region key is less than 1. Group the results by supplier name, part key, and nation key, and filter the results where the sum of the supplier nation key is not equal to 18. Finally, sort the results in ascending order based on the sum of the supplier nation key."}, {"sql": "SELECT l_orderkey, o_custkey, MIN(l_tax) FROM lineitem JOIN orders ON o_orderkey = l_orderkey WHERE l_extendedprice >= 13764.4 AND l_comment <> 'cajole carefully-- bold accounts nag blith' AND l_shipmode = 'FOB' AND l_shipinstruct <> 'TAKE BACK RETURN' GROUP BY l_orderkey, o_custkey ORDER BY l_orderkey ASC, o_custkey DESC", "res_cnt": "4432910", "execution_time": "201.59", "text": "Retrieve the minimum value of the \"l_tax\" column for each unique combination of \"l_orderkey\" and \"o_custkey\" from the \"lineitem\" and \"orders\" tables, respectively, where the \"l_extendedprice\" is greater than or equal to 13764.4, \"l_comment\" is not equal to 'cajole carefully-- bold accounts nag blith', \"l_shipmode\" is 'FOB', and \"l_shipinstruct\" is not equal to 'TAKE BACK RETURN', and sort the results in ascending order by \"l_orderkey\" and descending order by \"o_custkey\"."}, {"sql": "SELECT c_mktsegment, o_comment FROM customer JOIN orders ON o_custkey = c_custkey WHERE o_orderdate = '1993-08-06' AND c_phone <> '10-880-620-4229' AND o_totalprice > 112609.58 AND o_orderkey >= 3241411 AND o_orderpriority = '3-MEDIUM' ORDER BY o_comment DESC", "res_cnt": "694", "execution_time": "5.69", "text": "Retrieve the market segment and order comments from the customer and orders tables, respectively, where the order date is August 6th, 1993, the customer phone number is not 10-880-620-4229, the order total price is greater than 112609.58, the order key is greater than or equal to 3241411, and the order priority is 3-MEDIUM, and sort the results by order comments in descending order."}, {"sql": "SELECT l_orderkey FROM lineitem WHERE l_partkey < 31126 AND l_shipdate > '1994-12-26' AND l_suppkey <= 701 AND l_extendedprice <> 17058.56 AND l_shipmode = 'MAIL'", "res_cnt": "855", "execution_time": "67.07", "text": "Retrieve the order key from the line item table where the part key is less than 31126, the ship date is after December 26th, 1994, the supplier key is less than or equal to 701, the extended price is not equal to 17058.56, and the ship mode is 'MAIL'."}, {"sql": "SELECT c_acctbal, o_custkey FROM orders JOIN customer ON c_custkey = o_custkey WHERE c_phone <> '23-576-689-1958' AND c_acctbal <> 982.37 AND c_nationkey < 9 AND o_custkey <= 27481", "res_cnt": "98195", "execution_time": "3.54", "text": "Retrieve the account balance and customer key from the orders and customer tables, respectively, where the customer's phone number is not '23-576-689-1958', the account balance is not equal to 982.37, the customer's nation key is less than 9, and the customer key in the orders table is less than or equal to 27481."}, {"sql": "SELECT o_orderpriority, c_name, l_partkey, n_name, MAX(n_comment) FROM nation JOIN customer ON c_nationkey = n_nationkey JOIN orders ON o_custkey = c_custkey JOIN lineitem ON l_orderkey = o_orderkey WHERE l_shipmode <= 'RAIL' AND o_orderdate < '1998-06-21' GROUP BY o_orderpriority, c_name, l_partkey, n_name ORDER BY l_partkey ASC, c_name ASC, o_orderpriority DESC", "res_cnt": "33664366", "execution_time": "1264.11", "text": "Retrieve the maximum value of the \"n_comment\" column along with \"o_orderpriority\", \"c_name\", \"l_partkey\", and \"n_name\" columns from the \"nation\", \"customer\", \"orders\", and \"lineitem\" tables, where the \"l_shipmode\" column is less than or equal to 'RAIL' and the \"o_orderdate\" column is less than '1998-06-21', group the result by \"o_orderpriority\", \"c_name\", \"l_partkey\", and \"n_name\", and sort the result by \"l_partkey\" in ascending order, \"c_name\" in ascending order, and \"o_orderpriority\" in descending order."}, {"sql": "SELECT n_regionkey, c_custkey, r_name FROM region, nation, customer WHERE n_nationkey <> 6 AND c_mktsegment < 'FURNITURE' AND c_comment >= 'ully unusual packages wake bravely bold packages. unusual requests boost deposits! blithely ironic packages ab' ORDER BY n_regionkey ASC", "res_cnt": "5802120", "execution_time": "28.91", "text": "Retrieve the region key, customer key, and region name from the region, nation, and customer tables where the nation key is not equal to 6, the market segment is less than 'FURNITURE', and the comment is greater than or equal to 'ully unusual packages wake bravely bold packages. unusual requests boost deposits! blithely ironic packages ab', and sort the result by region key in ascending order."}, {"sql": "SELECT s_phone, ps_suppkey, MAX(s_name) FROM partsupp JOIN supplier ON s_suppkey = ps_suppkey WHERE s_suppkey >= 3256 AND s_nationkey >= 6 AND s_phone <= '26-319-194-2678' GROUP BY s_phone, ps_suppkey HAVING MAX(s_name) >= 'Supplier#000005330' ORDER BY MAX(s_name) ASC", "res_cnt": "38930", "execution_time": "62.81", "text": "Retrieve the supplier phone number, supplier key, and maximum supplier name from the partsupp and supplier tables where the supplier key is greater than or equal to 3256, the supplier nation key is greater than or equal to 6, and the supplier phone number is less than or equal to '26-319-194-2678'. Group the results by supplier phone number and supplier key, and filter the results to only include those with a maximum supplier name greater than or equal to 'Supplier#000005330'. Finally, sort the results by the maximum supplier name in ascending order."}, {"sql": "SELECT c_custkey, n_comment, p_size, s_suppkey, ps_suppkey FROM part JOIN partsupp ON ps_partkey = p_partkey JOIN supplier ON s_suppkey = ps_suppkey JOIN nation ON n_nationkey = s_nationkey JOIN customer ON c_nationkey = n_nationkey WHERE n_comment > 'al foxes promise slyly according to the regular accounts. bold requests alon' AND s_name = 'Supplier#000005891' AND ps_suppkey <> 7616 ORDER BY n_comment ASC", "res_cnt": "4786720", "execution_time": "62.81", "text": "Retrieve the customer key, comment, part size, supplier key, and partsupplier supplier key from the part, partsupplier, supplier, nation, and customer tables where the nation comment is greater than 'al foxes promise slyly according to the regular accounts. bold requests alon', the supplier name is 'Supplier#000005891', and the partsupplier supplier key is not equal to 7616, and sort the results in ascending order based on the nation comment."}, {"sql": "SELECT p_container, s_phone, ps_supplycost FROM part JOIN partsupp ON ps_partkey = p_partkey JOIN supplier ON s_suppkey = ps_suppkey WHERE s_phone <= '25-418-344-7176' AND s_address >= 'HdteuyoPpBVg' AND ps_partkey >= 152695 ORDER BY s_phone DESC, p_container DESC", "res_cnt": "2751434", "execution_time": "20.60", "text": "Retrieve the container type, phone number of the supplier, and supply cost of the part, for all parts that have a part key greater than or equal to 152695, and are supplied by a supplier whose phone number is less than or equal to '25-418-344-7176' and whose address is greater than or equal to 'HdteuyoPpBVg'. Sort the results in descending order by supplier phone number and then by container type."}, {"sql": "SELECT o_clerk, c_phone FROM orders JOIN customer ON c_custkey = o_custkey WHERE o_clerk < 'Clerk#000000377' AND o_shippriority = 0 AND o_orderstatus <> 'P' AND c_comment <= 'r, even accounts. fluffily expre' ORDER BY o_clerk DESC", "res_cnt": "392518", "execution_time": "31.61", "text": "Retrieve the clerk name and phone number of customers who have placed orders with a shipping priority of 0 and an order status that is not 'P', and whose clerk name is less than 'Clerk#000000377', and whose customer comment includes the phrase 'r, even accounts. fluffily expre', sorted in descending order by clerk name."}, {"sql": "SELECT o_orderdate, l_comment, MIN(l_orderkey), MIN(o_custkey) FROM orders JOIN lineitem ON l_orderkey = o_orderkey WHERE o_orderstatus >= 'P' AND o_orderpriority = '3-MEDIUM' AND o_clerk <= 'Clerk#000000629' GROUP BY o_orderdate, l_comment ORDER BY l_comment ASC, o_orderdate DESC", "res_cnt": "23591", "execution_time": "60.72", "text": "Retrieve the earliest order date, line item comment, minimum order key, and minimum customer key for orders that have an order status greater than or equal to 'P', an order priority of '3-MEDIUM', and a clerk less than or equal to 'Clerk#000000629', by joining the orders and lineitem tables on the order key, group the results by order date and line item comment, and sort the results by line item comment in ascending order and order date in descending order."}, {"sql": "SELECT l_comment, s_comment, ps_availqty FROM supplier JOIN partsupp ON ps_suppkey = s_suppkey JOIN lineitem ON l_suppkey = ps_partkey WHERE l_comment >= 'odolites along the blithely special a' AND s_nationkey >= 6 AND l_linenumber >= 6 ORDER BY l_comment ASC, s_comment ASC, ps_availqty DESC", "res_cnt": "8045694", "execution_time": "276.79", "text": "Retrieve the comments from the lineitem and supplier tables, along with the available quantity from the partsupp table, where the comment in the lineitem table is greater than or equal to 'odolites along the blithely special a', the nation key in the supplier table is greater than or equal to 6, and the line number in the lineitem table is greater than or equal to 6. Sort the results in ascending order by the comment in the lineitem table, then by the comment in the supplier table, and finally by the available quantity in descending order."}, {"sql": "SELECT c_name, s_phone, ps_supplycost, n_comment FROM customer JOIN nation ON n_nationkey = c_nationkey JOIN supplier ON s_nationkey = n_nationkey JOIN partsupp ON ps_suppkey = s_suppkey WHERE c_custkey > 90696 AND s_acctbal = 1845.54 AND ps_availqty <> 5628 ORDER BY n_comment ASC", "res_cnt": "4462800", "execution_time": "67.78", "text": "Retrieve the customer name, supplier phone number, part supplier supply cost, and nation comment by joining the customer, nation, supplier, and partsupp tables on their respective keys where the customer key is greater than 90696, supplier account balance is 1845.54, and part supplier available quantity is not equal to 5628, and sort the results in ascending order based on the nation comment."}, {"sql": "SELECT o_orderpriority, c_name, l_commitdate, MIN(l_shipdate) FROM customer JOIN orders ON o_custkey = c_custkey JOIN lineitem ON l_orderkey = o_orderkey WHERE l_shipinstruct >= 'TAKE BACK RETURN' AND c_acctbal <= 9242.58 AND o_clerk < 'Clerk#000000336' AND c_custkey >= 43536 AND c_phone < '11-943-882-4236' GROUP BY o_orderpriority, c_name, l_commitdate ORDER BY l_commitdate ASC", "res_cnt": "34564", "execution_time": "241.88", "text": "Retrieve the minimum shipment date, order priority, customer name, and committed date from the lineitem, customer, and orders tables where the shipment instruction is 'TAKE BACK RETURN', the account balance is less than or equal to 9242.58, the clerk is less than 'Clerk#000000336', the customer key is greater than or equal to 43536, and the phone number is less than '11-943-882-4236'. Group the results by order priority, customer name, and committed date, and sort the results by committed date in ascending order."}, {"sql": "SELECT l_receiptdate, p_partkey, ps_partkey, SUM(l_linenumber), MIN(p_type) FROM part JOIN partsupp ON ps_partkey = p_partkey JOIN lineitem ON l_suppkey = ps_partkey WHERE ps_supplycost = 362.95 AND p_container <> 'SM DRUM' GROUP BY l_receiptdate, p_partkey, ps_partkey HAVING SUM(l_linenumber) = 6 ORDER BY MIN(p_type) ASC, SUM(l_linenumber) DESC", "res_cnt": "225", "execution_time": "456.85", "text": "Retrieve the receipt date, part key, partsupp part key, sum of line numbers, and minimum part type from the part, partsupp, and lineitem tables where the partsupp supply cost is 362.95 and the part container is not 'SM DRUM', group the results by receipt date, part key, and partsupp part key, and filter the results to only include those with a sum of line numbers equal to 6, then sort the results by minimum part type in ascending order and sum of line numbers in descending order."}, {"sql": "SELECT o_comment, ps_suppkey, p_mfgr, l_suppkey FROM part JOIN partsupp ON ps_partkey = p_partkey JOIN lineitem ON l_suppkey = ps_partkey JOIN orders ON o_orderkey = l_orderkey WHERE p_comment > 'sleep s' AND l_linenumber <> 1 AND p_brand <= 'Brand#25' ORDER BY p_mfgr DESC", "res_cnt": "16212232", "execution_time": "766.15", "text": "Retrieve the comments of orders, supplier keys of partsupps, manufacturers of parts, and supplier keys of line items by joining the part, partsupp, lineitem, and orders tables where the comment of parts is greater than 'sleep s', the line number of line items is not equal to 1, and the brand of parts is less than or equal to 'Brand#25', and then sort the result by the manufacturer of parts in descending order."}, {"sql": "SELECT l_shipinstruct FROM lineitem WHERE l_linestatus > 'F' AND l_receiptdate >= '1994-07-02' AND l_tax < 0.04 AND l_returnflag > 'A' ORDER BY l_shipinstruct ASC", "res_cnt": "13322500", "execution_time": "138.70", "text": "Retrieve the shipping instructions from the lineitem table where the linestatus is greater than 'F', the receipt date is on or after '1994-07-02', the tax is less than 0.04, and the return flag is greater than 'A', and sort the results in ascending order based on the shipping instructions."}, {"sql": "SELECT s_address, l_shipdate, ps_comment FROM supplier JOIN partsupp ON ps_suppkey = s_suppkey JOIN lineitem ON l_suppkey = ps_partkey WHERE l_shipdate <= '1996-11-15' AND l_shipmode = 'RAIL' AND l_receiptdate < '1994-07-31' ORDER BY ps_comment ASC", "res_cnt": "12332892", "execution_time": "346.44", "text": "Retrieve the supplier's address, line item's shipment date, and part supplier's comment where the line item's shipment mode is 'RAIL', the line item's shipment date is on or before November 15, 1996, and the line item's receipt date is before July 31, 1994. Sort the results in ascending order based on the part supplier's comment."}, {"sql": "SELECT ps_suppkey, SUM(ps_partkey), AVG(ps_availqty), SUM(ps_supplycost) FROM partsupp WHERE ps_partkey < 73880 AND ps_availqty <> 9160 AND ps_supplycost < 892.65 GROUP BY ps_suppkey ORDER BY AVG(ps_availqty) ASC", "res_cnt": "99828", "execution_time": "0.99", "text": "Retrieve the supplier key, the sum of part keys, the average available quantity, and the sum of supply costs from the PartsSupp table where the part key is less than 73880, the available quantity is not equal to 9160, and the supply cost is less than 892.65. Group the results by supplier key and sort them in ascending order based on the average available quantity."}, {"sql": "SELECT c_phone, o_comment FROM customer JOIN orders ON o_custkey = c_custkey WHERE c_custkey < 73501 AND c_nationkey <= 23 AND o_orderpriority < '2-HIGH' AND o_orderstatus >= 'O' AND o_clerk < 'Clerk#000000623'", "res_cnt": "4588", "execution_time": "22.03", "text": "Retrieve the phone number and order comment of customers who have made orders with order priority less than '2-HIGH', order status greater than or equal to 'O', and clerk less than 'Clerk#000000623', and whose customer key is less than 73501 and nation key is less than or equal to 23."}, {"sql": "SELECT l_shipinstruct, s_name, ps_supplycost, MIN(s_name) FROM lineitem JOIN partsupp ON ps_partkey = l_suppkey JOIN supplier ON s_suppkey = ps_suppkey WHERE l_commitdate <= '1993-05-13' AND l_quantity < 6.0 AND s_address > 'pIXH,lXMVPMknhTIXb4owWLtOvOmsdb' GROUP BY l_shipinstruct, s_name, ps_supplycost HAVING MIN(s_name) > 'Supplier#000003443'", "res_cnt": "490286", "execution_time": "116.48", "text": "Retrieve the shipping instructions, supplier name, part supply cost, and the minimum supplier name from the lineitem, partsupp, and supplier tables where the commit date is on or before May 13th, 1993, the quantity is less than 6.0, and the supplier address is greater than 'pIXH,lXMVPMknhTIXb4owWLtOvOmsdb'. Group the results by shipping instructions, supplier name, and part supply cost, and filter the results to only include those with a minimum supplier name greater than 'Supplier#000003443'."}]