[{"sql": "SELECT l_tax, o_totalprice FROM lineitem JOIN orders ON o_orderkey = l_orderkey WHERE l_linenumber >= 3 AND o_orderkey <> 784709 AND l_orderkey <= 189383 AND o_clerk < 'Clerk#000000181'", "res_cnt": "1707", "execution_time": "4.83", "text": "Retrieve the tax rate and total price from the lineitem and orders tables where the line number is greater than or equal to 3, the order key is not equal to 784709, the order key is less than or equal to 189383, and the clerk's ID is less than 'Clerk#000000181'."},
{"sql": "SELECT p_type, ps_availqty, SUM(ps_suppkey) FROM part JOIN partsupp ON ps_partkey = p_partkey WHERE ps_suppkey <> 3804 AND ps_partkey <= 57823 AND ps_availqty < 4781 GROUP BY p_type, ps_availqty HAVING SUM(ps_suppkey) > 1089 ORDER BY SUM(ps_suppkey) ASC", "res_cnt": "100967", "execution_time": "2.25", "text": "Retrieve the part type, available quantity of parts, and the sum of supplier keys from the part and partsupp tables where the supplier key is not equal to 3804, the part key is less than or equal to 57823, and the available quantity of parts is less than 4781. Group the results by part type and available quantity of parts, and only include groups where the sum of supplier keys is greater than 1089. Sort the results in ascending order based on the sum of supplier keys."},
{"sql": "SELECT c_phone, o_totalprice, n_comment, r_comment FROM orders JOIN customer ON c_custkey = o_custkey JOIN nation ON n_nationkey = c_nationkey JOIN region ON r_regionkey = n_regionkey WHERE n_nationkey < 8 AND o_orderstatus >= 'O' AND o_comment < 'ly around the pending theodo' ORDER BY c_phone ASC, n_comment ASC, o_totalprice ASC, r_comment ASC", "res_cnt": "1249285", "execution_time": "32.55", "text": "Retrieve the phone number of the customer, the total price of the order, the comment of the nation, and the comment of the region from the orders table, customer table, nation table, and region table, respectively, where the nation key is less than 8, the order status is greater than or equal to 'O', and the order comment is less than 'ly around the pending theodo'. Sort the result by customer phone number in ascending order, nation comment in ascending order, order total price in ascending order, and region comment in ascending order."}, 
{"sql": "SELECT s_acctbal, ps_supplycost, r_regionkey, n_name FROM region JOIN nation ON n_regionkey = r_regionkey JOIN supplier ON s_nationkey = n_nationkey JOIN partsupp ON ps_suppkey = s_suppkey WHERE r_name <= 'AFRICA' AND n_comment >= 'l platelets. regular accounts x-ray: unusual, regular acco' AND s_nationkey >= 0", "res_cnt": "1272240", "execution_time": "22.09", "text": "Retrieve the account balance, supply cost, region key, and nation name from the region, nation, supplier, and partsupp tables where the region name is less than or equal to 'AFRICA', the nation comment is greater than or equal to 'l platelets. regular accounts x-ray: unusual, regular acco', and the supplier nation key is greater than or equal to 0."}, 
{"sql": "SELECT o_orderkey, c_address FROM customer JOIN orders ON o_custkey = c_custkey WHERE c_phone <> '29-716-678-7355' AND o_custkey <= 16201 AND o_totalprice > 29849.7 AND o_clerk <> 'Clerk#000000361' AND o_shippriority >= 0 ORDER BY c_address DESC", "res_cnt": "150302", "execution_time": "2.55", "text": "Retrieve the order key and customer address from the customer and orders tables where the customer phone number is not '29-716-678-7355', the customer key is less than or equal to 16201, the order total price is greater than 29849.7, the order clerk is not 'Clerk#000000361', and the order ship priority is greater than or equal to 0. Sort the results by customer address in descending order."}, 
{"sql": "SELECT s_comment, p_size, ps_supplycost FROM part JOIN partsupp ON ps_partkey = p_partkey JOIN supplier ON s_suppkey = ps_suppkey WHERE ps_availqty = 6331 AND p_type > 'LARGE POLISHED NICKEL' AND p_retailprice < 1758.76 ORDER BY s_comment DESC", "res_cnt": "394", "execution_time": "7.79", "text": "Retrieve the comments of suppliers, size of parts, and supply cost of part-supplier combinations where the available quantity of the part is 6331, the type of the part is greater than 'LARGE POLISHED NICKEL', and the retail price of the part is less than 1758.76. The results should be sorted in descending order based on the comments of the suppliers."}, 
{"sql": "SELECT l_shipdate FROM lineitem WHERE l_extendedprice >= 50883.12 AND l_linenumber > 1 AND l_shipdate <> '1992-08-30' AND l_returnflag = 'A' ORDER BY l_shipdate DESC", "res_cnt": "3376197", "execution_time": "93.75", "text": "Retrieve the shipment dates from the lineitem table where the extended price is greater than or equal to 50883.12, the linenumber is greater than 1, the shipdate is not equal to '1992-08-30', and the return flag is 'A', and sort the results in descending order based on the shipment date."},
{"sql": "SELECT c_acctbal, o_orderpriority, n_name FROM nation JOIN customer ON c_nationkey = n_nationkey JOIN orders ON o_custkey = c_custkey WHERE c_comment = 'ar deposits believe special, express foxes. packages cajole slyly e' AND n_name <> 'JAPAN' AND c_mktsegment = 'HOUSEHOLD' AND o_totalprice < 110238.65 AND c_name <= 'Customer#000013191'", "res_cnt": "7", "execution_time": "1.88", "text": "Retrieve the account balance, order priority, and nation name for customers who have a comment of 'ar deposits believe special, express foxes. packages cajole slyly e', are not from Japan, have a market segment of 'HOUSEHOLD', have a total order price less than 110238.65, and have a name less than or equal to 'Customer#000013191'."}, 
{"sql": "SELECT p_type, ps_comment FROM part JOIN partsupp ON ps_partkey = p_partkey WHERE ps_availqty <> 1078 AND p_type < 'PROMO BURNISHED NICKEL' AND p_size > 8 AND p_container < 'LG CAN'", "res_cnt": "974546", "execution_time": "13.71", "text": "Retrieve the part type and part supplier comment from the Part and Partsupp tables where the available quantity of the part supplier is not equal to 1078, the part type is less than 'PROMO BURNISHED NICKEL', the part size is greater than 8, and the part container is less than 'LG CAN'."}, 
{"sql": "SELECT ps_comment FROM partsupp WHERE ps_availqty >= 9324 AND ps_suppkey <> 1716 AND ps_partkey >= 65143 AND ps_supplycost < 164.19 AND ps_comment <> 's use slyly pending instructions. furiously final ideas shall have to are c'", "res_cnt": "85446", "execution_time": "9.15", "text": "Retrieve the comments from the \"partsupp\" table where the available quantity is greater than or equal to 9324, the supplier key is not equal to 1716, the part key is greater than or equal to 65143, the supply cost is less than 164.19, and the comment is not equal to 's use slyly pending instructions. furiously final ideas shall have to are c'."}, 
{"sql": "SELECT r_name, s_suppkey, n_regionkey FROM supplier, nation, region WHERE r_regionkey >= 1 AND s_suppkey <= 9696 AND r_comment <> 'uickly special accounts cajole carefully blithely close requests. carefully final asymptotes haggle furiousl' AND s_name < 'Supplier#000008309' AND s_phone <> '19-247-536-8083' ORDER BY s_suppkey ASC, n_regionkey DESC, r_name ASC", "res_cnt": "623025", "execution_time": "3.5", "text": "Retrieve the supplier name, supplier key, and region key from the supplier, nation, and region tables where the region key is greater than or equal to 1, the supplier key is less than or equal to 9696, the region comment is not equal to 'uickly special accounts cajole carefully blithely close requests. carefully final asymptotes haggle furiousl', the supplier name is less than 'Supplier#000008309', and the supplier phone is not equal to '19-247-536-8083', and sort the results by supplier key in ascending order, region key in descending order, and region name in ascending order."}, 
{"sql": "SELECT o_orderpriority FROM orders WHERE o_orderpriority > '3-MEDIUM' AND o_totalprice > 130861.55 AND o_comment < 'inally pending packages sleep along the furiously special' AND o_custkey <= 16480 AND o_shippriority <= 0 AND o_orderdate <> '1997-02-20' ORDER BY o_orderpriority ASC", "res_cnt": "14448", "execution_time": "1.70", "text": "Retrieve the order priority from the \"orders\" table where the order priority is greater than '3-MEDIUM', the total price is greater than 130861.55, the comment is less than 'finally pending packages sleep along the furiously special', the customer key is less than or equal to 16480, the ship priority is less than or equal to 0, and the order date is not equal to '1997-02-20', and sort the results in ascending order based on the order priority."}
]